#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/csepulveda_io/AWSBaseSetup/runs/run-u5x7mHGgtfSZ8Hym

Waiting for the plan to start...

Terraform v1.0.0
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.aws_static_website.aws_acm_certificate.wildcard_website: Refreshing state... [id=arn:aws:acm:us-east-1:107584640829:certificate/35d640b2-5ceb-4f89-88f3-889cde860c79]
module.aws_static_website.aws_s3_bucket.website_logs: Refreshing state... [id=csepulveda.io-logs]
aws_route53_zone.primary: Refreshing state... [id=Z09309173TX5H4I19KYIU]
module.aws_static_website.aws_route53_record.wildcard_validation: Refreshing state... [id=Z09309173TX5H4I19KYIU__b5d5fb2e388042f78fd19d630ef16304.csepulveda.io._CNAME]
module.aws_static_website.aws_acm_certificate_validation.wildcard_cert: Refreshing state... [id=2021-06-22 16:18:26 +0000 UTC]
module.aws_static_website.aws_s3_bucket.website_root: Refreshing state... [id=csepulveda.io-root]
module.aws_static_website.aws_s3_bucket.website_redirect: Refreshing state... [id=csepulveda.io-redirect]
module.aws_static_website.aws_cloudfront_distribution.website_cdn_redirect: Refreshing state... [id=E80BFWFSTH9N8]
module.aws_static_website.aws_s3_bucket_policy.update_website_root_bucket_policy: Refreshing state... [id=csepulveda.io-root]
module.aws_static_website.aws_cloudfront_distribution.website_cdn_root: Refreshing state... [id=E1GON5LWI0YJQ8]
module.aws_static_website.aws_route53_record.website_cdn_redirect_record: Refreshing state... [id=Z09309173TX5H4I19KYIU_blog.csepulveda.io_A]
module.aws_static_website.aws_route53_record.website_cdn_root_record: Refreshing state... [id=Z09309173TX5H4I19KYIU_csepulveda.io_A]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.aws_static_website.aws_acm_certificate.wildcard_website has been changed
  ~ resource "aws_acm_certificate" "wildcard_website" {
        id                        = "arn:aws:acm:us-east-1:107584640829:certificate/35d640b2-5ceb-4f89-88f3-889cde860c79"
      ~ status                    = "PENDING_VALIDATION" -> "ISSUED"
        tags                      = {
            "Changed"   = "2021-06-22 16:18 UTC"
            "ManagedBy" = "terraform"
        }
      + tags_all                  = {
          + "Changed"   = "2021-06-22 16:18 UTC"
          + "ManagedBy" = "terraform"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.aws_static_website.aws_s3_bucket_policy.update_website_root_bucket_policy has been changed
  ~ resource "aws_s3_bucket_policy" "update_website_root_bucket_policy" {
        id     = "csepulveda.io-root"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = [
                          - "s3:GetObject",
                        ] -> "s3:GetObject"
                        # (4 unchanged elements hidden)
                    },
                ]
                # (2 unchanged elements hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }
  # module.aws_static_website.aws_cloudfront_distribution.website_cdn_redirect has been changed
  ~ resource "aws_cloudfront_distribution" "website_cdn_redirect" {
        id                             = "E80BFWFSTH9N8"
        tags                           = {
            "Changed"   = "2021-06-22 16:18 UTC"
            "ManagedBy" = "terraform"
        }
      + tags_all                       = {
          + "Changed"   = "2021-06-22 16:18 UTC"
          + "ManagedBy" = "terraform"
        }
      + trusted_key_groups             = [
          + {
              + enabled = false
              + items   = []
            },
        ]
      + trusted_signers                = [
          + {
              + enabled = false
              + items   = []
            },
        ]
        # (16 unchanged attributes hidden)

      ~ default_cache_behavior {
          + trusted_key_groups     = []
          + trusted_signers        = []
            # (9 unchanged attributes hidden)

          ~ forwarded_values {
              + headers                 = []
              + query_string_cache_keys = []
                # (1 unchanged attribute hidden)

              ~ cookies {
                  + whitelisted_names = []
                    # (1 unchanged attribute hidden)
                }
            }
        }


      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "csepulveda.io-redirect.s3-website-us-west-2.amazonaws.com"
          + origin_id           = "origin-bucket-csepulveda.io-redirect"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "http-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      - origin {
          - domain_name = "csepulveda.io-redirect.s3-website-us-west-2.amazonaws.com" -> null
          - origin_id   = "origin-bucket-csepulveda.io-redirect" -> null

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "http-only" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }

      ~ restrictions {
          ~ geo_restriction {
              + locations        = []
                # (1 unchanged attribute hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }
  # module.aws_static_website.aws_route53_record.wildcard_validation has been changed
  ~ resource "aws_route53_record" "wildcard_validation" {
        id      = "Z09309173TX5H4I19KYIU__b5d5fb2e388042f78fd19d630ef16304.csepulveda.io._CNAME"
        name    = "_b5d5fb2e388042f78fd19d630ef16304.csepulveda.io"
        # (5 unchanged attributes hidden)
    }
  # module.aws_static_website.aws_s3_bucket.website_root has been changed
  ~ resource "aws_s3_bucket" "website_root" {
        id                          = "csepulveda.io-root"
        tags                        = {
            "Changed"   = "2021-06-22 16:18 UTC"
            "ManagedBy" = "terraform"
        }
      + tags_all                    = {
          + "Changed"   = "2021-06-22 16:18 UTC"
          + "ManagedBy" = "terraform"
        }
        # (11 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }
  # module.aws_static_website.aws_route53_record.website_cdn_redirect_record has been changed
  ~ resource "aws_route53_record" "website_cdn_redirect_record" {
        id      = "Z09309173TX5H4I19KYIU_blog.csepulveda.io_A"
        name    = "blog.csepulveda.io"
      + records = []
      + ttl     = 0
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.aws_static_website.aws_cloudfront_distribution.website_cdn_root has been changed
  ~ resource "aws_cloudfront_distribution" "website_cdn_root" {
        id                             = "E1GON5LWI0YJQ8"
        tags                           = {
            "Changed"   = "2021-06-22 16:18 UTC"
            "ManagedBy" = "terraform"
        }
      + tags_all                       = {
          + "Changed"   = "2021-06-22 16:18 UTC"
          + "ManagedBy" = "terraform"
        }
      + trusted_key_groups             = [
          + {
              + enabled = false
              + items   = []
            },
        ]
      + trusted_signers                = [
          + {
              + enabled = false
              + items   = []
            },
        ]
        # (16 unchanged attributes hidden)


      ~ default_cache_behavior {
          + trusted_key_groups     = []
          + trusted_signers        = []
            # (9 unchanged attributes hidden)

          ~ forwarded_values {
              + headers                 = []
              + query_string_cache_keys = []
                # (1 unchanged attribute hidden)

              ~ cookies {
                  + whitelisted_names = []
                    # (1 unchanged attribute hidden)
                }
            }
        }


      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "csepulveda.io-root.s3-website-us-west-2.amazonaws.com"
          + origin_id           = "origin-bucket-csepulveda.io-root"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "http-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }
      - origin {
          - domain_name = "csepulveda.io-root.s3-website-us-west-2.amazonaws.com" -> null
          - origin_id   = "origin-bucket-csepulveda.io-root" -> null

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "http-only" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }

      ~ restrictions {
          ~ geo_restriction {
              + locations        = []
                # (1 unchanged attribute hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }
  # module.aws_static_website.aws_route53_record.website_cdn_root_record has been changed
  ~ resource "aws_route53_record" "website_cdn_root_record" {
        id      = "Z09309173TX5H4I19KYIU_csepulveda.io_A"
        name    = "csepulveda.io"
      + records = []
      + ttl     = 0
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.aws_static_website.aws_s3_bucket.website_logs has been changed
  ~ resource "aws_s3_bucket" "website_logs" {
        id                          = "csepulveda.io-logs"
        tags                        = {
            "Changed"   = "2021-06-22 16:18 UTC"
            "ManagedBy" = "terraform"
        }
      + tags_all                    = {
          + "Changed"   = "2021-06-22 16:18 UTC"
          + "ManagedBy" = "terraform"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.aws_static_website.aws_s3_bucket.website_redirect has been changed
  ~ resource "aws_s3_bucket" "website_redirect" {
        id                          = "csepulveda.io-redirect"
        tags                        = {
            "Changed"   = "2021-06-22 16:18 UTC"
            "ManagedBy" = "terraform"
        }
      + tags_all                    = {
          + "Changed"   = "2021-06-22 16:18 UTC"
          + "ManagedBy" = "terraform"
        }
        # (11 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }
  # aws_route53_zone.primary has been changed
  ~ resource "aws_route53_zone" "primary" {
        id            = "Z09309173TX5H4I19KYIU"
      ~ name          = "csepulveda.io." -> "csepulveda.io"
        tags          = {}
      + tags_all      = {}
        # (4 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "cluster"  {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # data.aws_eks_cluster_auth.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "cluster"  {
      + id    = (known after apply)
      + name  = (known after apply)
      + token = (sensitive value)
    }

  # module.aws_static_website.data.aws_acm_certificate.wildcard_website will be read during apply
  # (config refers to values not yet known)
 <= data "aws_acm_certificate" "wildcard_website"  {
      ~ arn         = "arn:aws:acm:us-east-1:107584640829:certificate/35d640b2-5ceb-4f89-88f3-889cde860c79" -> (known after apply)
      ~ id          = "2021-06-22 16:18:54.222408975 +0000 UTC" -> (known after apply)
      ~ tags        = {
          - "Changed"   = "2021-06-22 16:18 UTC"
          - "ManagedBy" = "terraform"
        } -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.aws_static_website.aws_acm_certificate_validation.wildcard_cert must be replaced
-/+ resource "aws_acm_certificate_validation" "wildcard_cert" {
      ~ id                      = "2021-06-22 16:18:26 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [
          - "_b5d5fb2e388042f78fd19d630ef16304.csepulveda.io",
        ] -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.aws_static_website.aws_cloudfront_distribution.website_cdn_redirect will be updated in-place
  ~ resource "aws_cloudfront_distribution" "website_cdn_redirect" {
      - default_root_object            = "index.html" -> null
        id                             = "E80BFWFSTH9N8"
        tags                           = {
            "Changed"   = "2021-06-22 16:18 UTC"
            "ManagedBy" = "terraform"
        }
        # (18 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

  # module.aws_static_website.aws_route53_record.wildcard_validation will be destroyed
  - resource "aws_route53_record" "wildcard_validation" {
      - fqdn    = "_b5d5fb2e388042f78fd19d630ef16304.csepulveda.io" -> null
      - id      = "Z09309173TX5H4I19KYIU__b5d5fb2e388042f78fd19d630ef16304.csepulveda.io._CNAME" -> null
      - name    = "_b5d5fb2e388042f78fd19d630ef16304.csepulveda.io" -> null
      - records = [
          - "_4e55e717f904bfaf23c61490b3d6c880.gwpjclltnz.acm-validations.aws.",
        ] -> null
      - ttl     = 60 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z09309173TX5H4I19KYIU" -> null
    }

  # module.aws_static_website.aws_route53_record.wildcard_validation["*.csepulveda.io"] will be created
  + resource "aws_route53_record" "wildcard_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_b5d5fb2e388042f78fd19d630ef16304.csepulveda.io"
      + records         = [
          + "_4e55e717f904bfaf23c61490b3d6c880.gwpjclltnz.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z09309173TX5H4I19KYIU"
    }

  # module.aws_static_website.aws_route53_record.wildcard_validation["csepulveda.io"] will be created
  + resource "aws_route53_record" "wildcard_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_b5d5fb2e388042f78fd19d630ef16304.csepulveda.io"
      + records         = [
          + "_4e55e717f904bfaf23c61490b3d6c880.gwpjclltnz.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z09309173TX5H4I19KYIU"
    }

  # module.eks.data.http.wait_for_cluster[0] will be read during apply
  # (config refers to values not yet known)
 <= data "http" "wait_for_cluster"  {
      + body             = (known after apply)
      + ca_certificate   = (known after apply)
      + id               = (known after apply)
      + response_headers = (known after apply)
      + timeout          = 300
      + url              = (known after apply)
    }

  # module.eks.aws_autoscaling_group.workers[0] will be created
  + resource "aws_autoscaling_group" "workers" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + capacity_rebalance        = false
      + default_cooldown          = (known after apply)
      + desired_capacity          = 1
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + launch_configuration      = (known after apply)
      + max_instance_lifetime     = 0
      + max_size                  = 10
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = (known after apply)
      + name_prefix               = "cluster1-0"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + suspended_processes       = [
          + "AZRebalance",
        ]
      + termination_policies      = []
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "cluster1-0-eks_asg"
        }
      + tag {
          + key                 = "k8s.io/cluster-autoscaler/cluster1"
          + propagate_at_launch = true
          + value               = "owned"
        }
      + tag {
          + key                 = "k8s.io/cluster-autoscaler/enabled"
          + propagate_at_launch = true
          + value               = "TRUE"
        }
      + tag {
          + key                 = "k8s.io/cluster/cluster1"
          + propagate_at_launch = true
          + value               = "owned"
        }
      + tag {
          + key                 = "kubernetes.io/cluster/cluster1"
          + propagate_at_launch = true
          + value               = "owned"
        }
    }

  # module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "cluster1"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + tags_all              = (known after apply)
      + version               = "1.20"

      + kubernetes_network_config {
          + service_ipv4_cidr = (known after apply)
        }

      + timeouts {
          + create = "30m"
          + delete = "15m"
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_instance_profile.workers[0] will be created
  + resource "aws_iam_instance_profile" "workers" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "cluster1"
      + path        = "/"
      + role        = (known after apply)
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
  + resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Name" = "cluster1-eks-irsa"
        }
      + tags_all        = {
          + "Name" = "cluster1-eks-irsa"
        }
      + thumbprint_list = [
          + "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ]
      + url             = (known after apply)
    }

  # module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0] will be created
  + resource "aws_iam_policy" "cluster_elb_sl_role_creation" {
      + arn         = (known after apply)
      + description = "Permissions for EKS to create AWSServiceRoleForElasticLoadBalancing service-linked role"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "cluster1-elb-sl-role-creation"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAccountAttributes",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.eks.aws_iam_role.cluster[0] will be created
  + resource "aws_iam_role" "cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "cluster1"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.aws_iam_role.workers[0] will be created
  + resource "aws_iam_role" "workers" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSWorkerAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "cluster1"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSServicePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSVPCResourceControllerPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_elb_sl_role_creation" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks.aws_launch_configuration.workers[0] will be created
  + resource "aws_launch_configuration" "workers" {
      + arn                         = (known after apply)
      + associate_public_ip_address = false
      + ebs_optimized               = true
      + enable_monitoring           = true
      + iam_instance_profile        = (known after apply)
      + id                          = (known after apply)
      + image_id                    = "ami-0ef2b4aeb23264334"
      + instance_type               = "t3.medium"
      + key_name                    = (known after apply)
      + name                        = (known after apply)
      + name_prefix                 = "cluster1-0"
      + security_groups             = (known after apply)
      + user_data_base64            = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = "optional"
        }

      + root_block_device {
          + delete_on_termination = true
          + encrypted             = false
          + iops                  = 0
          + throughput            = (known after apply)
          + volume_size           = 100
          + volume_type           = "gp2"
        }
    }

  # module.eks.aws_security_group.cluster[0] will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "EKS cluster security group."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "cluster1"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "cluster1-eks_cluster_sg"
        }
      + tags_all               = {
          + "Name" = "cluster1-eks_cluster_sg"
        }
      + vpc_id                 = (known after apply)
    }

  # module.eks.aws_security_group.workers[0] will be created
  + resource "aws_security_group" "workers" {
      + arn                    = (known after apply)
      + description            = "Security group for all nodes in the cluster."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "cluster1"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                           = "cluster1-eks_worker_sg"
          + "kubernetes.io/cluster/cluster1" = "owned"
        }
      + tags_all               = {
          + "Name"                           = "cluster1-eks_worker_sg"
          + "kubernetes.io/cluster/cluster1" = "owned"
        }
      + vpc_id                 = (known after apply)
    }

  # module.eks.aws_security_group_rule.cluster_egress_internet[0] will be created
  + resource "aws_security_group_rule" "cluster_egress_internet" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow cluster egress access to the Internet."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.cluster_https_worker_ingress[0] will be created
  + resource "aws_security_group_rule" "cluster_https_worker_ingress" {
      + description              = "Allow pods to communicate with the EKS cluster API."
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.workers_egress_internet[0] will be created
  + resource "aws_security_group_rule" "workers_egress_internet" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow nodes all egress to the Internet."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.workers_ingress_cluster[0] will be created
  + resource "aws_security_group_rule" "workers_ingress_cluster" {
      + description              = "Allow workers pods to receive communication from the cluster control plane."
      + from_port                = 1025
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.workers_ingress_cluster_https[0] will be created
  + resource "aws_security_group_rule" "workers_ingress_cluster_https" {
      + description              = "Allow pods running extension API servers on port 443 to receive communication from cluster control plane."
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.workers_ingress_self[0] will be created
  + resource "aws_security_group_rule" "workers_ingress_self" {
      + description              = "Allow node to communicate with each other."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks.kubernetes_config_map.aws_auth[0] will be created
  + resource "kubernetes_config_map" "aws_auth" {
      + data = (known after apply)
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/managed-by" = "Terraform"
              + "terraform.io/module"          = "terraform-aws-modules.eks.aws"
            }
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.vpc.aws_db_subnet_group.database[0] will be created
  + resource "aws_db_subnet_group" "database" {
      + arn         = (known after apply)
      + description = "Database subnet group for k8s-vpc"
      + id          = (known after apply)
      + name        = "k8s-vpc"
      + name_prefix = (known after apply)
      + subnet_ids  = (known after apply)
      + tags        = {
          + "Name"                           = "k8s-vpc"
          + "kubernetes.io/cluster/cluster1" = "shared"
        }
      + tags_all    = {
          + "Name"                           = "k8s-vpc"
          + "kubernetes.io/cluster/cluster1" = "shared"
        }
    }

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"                           = "k8s-vpc-us-west-2a"
          + "kubernetes.io/cluster/cluster1" = "shared"
        }
      + tags_all             = {
          + "Name"                           = "k8s-vpc-us-west-2a"
          + "kubernetes.io/cluster/cluster1" = "shared"
        }
      + vpc                  = true
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"                           = "k8s-vpc"
          + "kubernetes.io/cluster/cluster1" = "shared"
        }
      + tags_all = {
          + "Name"                           = "k8s-vpc"
          + "kubernetes.io/cluster/cluster1" = "shared"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name"                           = "k8s-vpc-us-west-2a"
          + "kubernetes.io/cluster/cluster1" = "shared"
        }
      + tags_all             = {
          + "Name"                           = "k8s-vpc-us-west-2a"
          + "kubernetes.io/cluster/cluster1" = "shared"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"                           = "k8s-vpc-private"
          + "kubernetes.io/cluster/cluster1" = "shared"
        }
      + tags_all         = {
          + "Name"                           = "k8s-vpc-private"
          + "kubernetes.io/cluster/cluster1" = "shared"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"                           = "k8s-vpc-public"
          + "kubernetes.io/cluster/cluster1" = "shared"
        }
      + tags_all         = {
          + "Name"                           = "k8s-vpc-public"
          + "kubernetes.io/cluster/cluster1" = "shared"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[0] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[1] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[2] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.database[0] will be created
  + resource "aws_subnet" "database" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-west-2a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "172.16.7.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                           = "k8s-vpc-db-us-west-2a"
          + "kubernetes.io/cluster/cluster1" = "shared"
        }
      + tags_all                        = {
          + "Name"                           = "k8s-vpc-db-us-west-2a"
          + "kubernetes.io/cluster/cluster1" = "shared"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.database[1] will be created
  + resource "aws_subnet" "database" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-west-2b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "172.16.8.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                           = "k8s-vpc-db-us-west-2b"
          + "kubernetes.io/cluster/cluster1" = "shared"
        }
      + tags_all                        = {
          + "Name"                           = "k8s-vpc-db-us-west-2b"
          + "kubernetes.io/cluster/cluster1" = "shared"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.database[2] will be created
  + resource "aws_subnet" "database" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-west-2c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "172.16.9.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                           = "k8s-vpc-db-us-west-2c"
          + "kubernetes.io/cluster/cluster1" = "shared"
        }
      + tags_all                        = {
          + "Name"                           = "k8s-vpc-db-us-west-2c"
          + "kubernetes.io/cluster/cluster1" = "shared"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-west-2a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "172.16.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                            = "k8s-vpc-private-us-west-2a"
          + "kubernetes.io/cluster/cluster1"  = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + tags_all                        = {
          + "Name"                            = "k8s-vpc-private-us-west-2a"
          + "kubernetes.io/cluster/cluster1"  = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-west-2b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "172.16.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                            = "k8s-vpc-private-us-west-2b"
          + "kubernetes.io/cluster/cluster1"  = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + tags_all                        = {
          + "Name"                            = "k8s-vpc-private-us-west-2b"
          + "kubernetes.io/cluster/cluster1"  = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-west-2c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "172.16.3.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                            = "k8s-vpc-private-us-west-2c"
          + "kubernetes.io/cluster/cluster1"  = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + tags_all                        = {
          + "Name"                            = "k8s-vpc-private-us-west-2c"
          + "kubernetes.io/cluster/cluster1"  = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-west-2a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "172.16.4.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                           = "k8s-vpc-public-us-west-2a"
          + "kubernetes.io/cluster/cluster1" = "shared"
          + "kubernetes.io/role/elb"         = "1"
        }
      + tags_all                        = {
          + "Name"                           = "k8s-vpc-public-us-west-2a"
          + "kubernetes.io/cluster/cluster1" = "shared"
          + "kubernetes.io/role/elb"         = "1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-west-2b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "172.16.5.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                           = "k8s-vpc-public-us-west-2b"
          + "kubernetes.io/cluster/cluster1" = "shared"
          + "kubernetes.io/role/elb"         = "1"
        }
      + tags_all                        = {
          + "Name"                           = "k8s-vpc-public-us-west-2b"
          + "kubernetes.io/cluster/cluster1" = "shared"
          + "kubernetes.io/role/elb"         = "1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-west-2c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "172.16.6.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                           = "k8s-vpc-public-us-west-2c"
          + "kubernetes.io/cluster/cluster1" = "shared"
          + "kubernetes.io/role/elb"         = "1"
        }
      + tags_all                        = {
          + "Name"                           = "k8s-vpc-public-us-west-2c"
          + "kubernetes.io/cluster/cluster1" = "shared"
          + "kubernetes.io/role/elb"         = "1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "172.16.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name"                           = "k8s-vpc"
          + "kubernetes.io/cluster/cluster1" = "shared"
        }
      + tags_all                         = {
          + "Name"                           = "k8s-vpc"
          + "kubernetes.io/cluster/cluster1" = "shared"
        }
    }

Plan: 54 to add, 1 to change, 2 to destroy.


```
</details>
*Pusher: @csepulveda, Action: `pull_request`*